In [3]:
import numpy as np
import pandas as pd

In [4]:
dict1 = {
    "name":['arshaq', 'bilal', 'hashir', 'ahmed'],
    "marks":[91, 92, 75, 83],
    "city":['islamabad', 'karachi', 'peshawar', 'multan'],    
}

In [5]:
df = pd.DataFrame(dict1)

In [8]:
df

     name  marks       city
0  arshaq     91  islamabad
1   bilal     92    karachi
2  hashir     75   peshawar
3   ahmed     83     multan

In [9]:
df.to_csv('friends.csv')

In [11]:
df.to_csv('friends_without_index.csv', index=False)

In [12]:
df.head(2)

     name  marks       city
0  arshaq     91  islamabad
1   bilal     92    karachi

In [13]:
df.tail(2)

     name  marks      city
2  hashir     75  peshawar
3   ahmed     83    multan

In [15]:
df.describe()

           marks
count   4.000000
mean   85.250000
std     7.932003
min    75.000000
25%    81.000000
50%    87.000000
75%    91.250000
max    92.000000

In [22]:
train = pd.read_csv('train.csv')

In [23]:
train

   Train No  Speed       city
0       122     91  islamabad
1      1243     92    karachi
2     21344     75   peshawar
3      2134     75     multan

In [24]:
train['Speed'][0] = 50

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_38184\185416197.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  train['Speed'][0] = 50
C:\Users\LENOVO\AppData\Local\Temp\ipykernel_38184\185416197.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train['Speed'][0] = 50

In [25]:
train

   Train No  Speed       city
0       122     50  islamabad
1      1243     92    karachi
2     21344     75   peshawar
3      2134     75     multan

train.to_csv("train.csv")